Revit 2026 API

# SynchronizeWithCentralOptionsRelinquishViewWorksets Property

---

Indicates whether Revit should relinquish View worksets after synchronizing with central.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool RelinquishViewWorksets { get; }
```
```vb
Public ReadOnly Property RelinquishViewWorksets As Boolean
	Get
```
```cpp
public:
property bool RelinquishViewWorksets {
	bool get ();
}
```
```fsharp
member RelinquishViewWorksets : bool with get
```

#### Property Value

Boolean

This is a shortcut to access the value stored in ViewWorksets.

#### Reference

SynchronizeWithCentralOptions Class

Autodesk.Revit.DB Namespace